# ViewId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementOwnerViewFilter..::..ViewId Property
ElementOwnerViewFilter Class See Also
---
The view id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId ViewId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ViewId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ViewId {
	ElementId^ get ();
}
```

# See Also
ElementOwnerViewFilter Class
Autodesk.Revit.DB Namespace